<template>
    <div id="faq" class="faq">
        <div class="container">
            <h2>Часто задаваемые вопросы (FAQ)</h2>
            <div class="rounded-lg border border-[#dee2e6] overflow-hidden w-full" data-aos="fade-up">
                <UAccordion :items="items" :ui="{ wrapper: 'flex flex-col w-full' }">
                    <template #default="{ item, open }">
                        <UButton color="gray" variant="ghost"
                            class="border border-[#dee2e6] hover:!bg-blue-100 hover:!text-[#052c65]"
                            :ui="{ rounded: 'rounded-none', padding: { sm: 'px-3 py-4' } }">
                            <span class="text-black text-[1.2rem] font-normal">{{ item.label }}</span>
                            <template #trailing>
                                <UIcon name="i-heroicons-chevron-right-20-solid"
                                    class="w-8 h-7 ms-auto transform transition-transform duration-200 text-black"
                                    :class="[open && 'rotate-90']" />
                            </template>
                        </UButton>
                    </template>
                    <template #item="{ item }">
                        <div class="px-6 py-4  text-black text-[1rem]">
                            <div v-html="item.content" />
                        </div>
                    </template>
                </UAccordion>
            </div>

        </div>
    </div>
</template>

<script setup lang="ts">
const items = [{
    label: 'Вопрос 1: Какие услуги предоставляет Horizont Consult',
    defaultOpen: true,
    content: `
      <b>Мы предоставляем полный спектр консалтинговых услуг, в том числе:</b>
      <ul class="list-disc pl-6 pt-2 flex flex-col gap-2">
        <li>Разработка бизнес-планов и технико-экономических обоснований</li>
        <li>Подготовка отчетов о воздействии на окружающую среду (ЗВОС)</li>
        <li>Инвестиционный консалтинг и финансовое консультирование</li>
        <li>Разработка и управление проектами государственно-частного партнерства (ГЧП)</li>
        <li>Аутсорсинг бухгалтерского учета, включая ведение и восстановление финансовой отчетности</li>
      </ul>
    `
}, {
    label: 'Вопрос 2: Как связаться с вами для консультации?',
    content: 'Связаться с нами можно через форму обратной связи, размещенную в разделе «Контакты» нашего сайта, по телефону +998 952-000-952 или по электронной почте info@horizontconsult.uz. Наши специалисты ответят на ваш запрос в течение 1 рабочего дня.'
}, {
    label: 'Вопрос 3: Предоставляете ли вы услуги международного консалтинга?',
    content: 'Да, мы оказываем консультационные услуги на международном уровне. Наш опыт помогает клиентам в расширении на зарубежные рынки, содействии развитию бизнеса и установлении стратегических партнерств по всему миру.'
},  {
    label: 'Вопрос 4: Сколько стоят ваши услуги?',
    content: 'Стоимость наших услуг зависит от конкретной задачи, объема работ и сроков выполнения. Мы предлагаем индивидуальный подход к ценообразованию и гибкую систему оплаты. Для получения предварительной оценки стоимости свяжитесь с нашими специалистами и опишите ваш проект.'
},  {
    label: 'Вопрос 5: Какой опыт работы у ваших специалистов?',
    content: 'Наша команда состоит из высококвалифицированных специалистов со специализированным образованием и опытом работы в отрасли от 3 до 20 лет.'
}, {
    label: 'Вопрос 6: Как происходит процесс сотрудничества?',
    content: `
      <b>Процесс сотрудничества включает несколько этапов:</b>
      <ul class="list-decimal pl-6 pt-2 flex flex-col gap-2">
        <li>Первичная консультация и обсуждение проекта – понимание потребностей клиента и определение целей проекта.</li>
        <li>Подготовка коммерческого предложения — описание объема работ, результатов и сметы расходов.</li>
        <li>Подписание договора – установление юридических и операционных условий сотрудничества.</li>
        <li>Сбор необходимой информации – Сбор необходимых данных и материалов проекта.</li>
        <li>Выполнение работ согласно утвержденному плану – Реализация стратегий и проведение анализа.</li>
        <li>Представление результатов – предоставление выводов и рекомендаций.</li>
        <li>Проверка и корректировка (при необходимости) – внесение изменений на основе отзывов клиентов.</li>
        <li>Реализация проекта – Предоставление итоговых отчетов и заключений.</li>
      </ul>
      <p class="pt-5">Мы поддерживаем постоянную связь с нашими клиентами на протяжении всего процесса, регулярно предоставляя им обновленную информацию о ходе проекта.</p>
    `
}, {
    label: 'Вопрос 7: Обеспечиваете ли вы конфиденциальность информации?',
    content: 'Да, мы гарантируем полную конфиденциальность всей информации, полученной в ходе нашей работы. Мы придерживаемся строгих политик защиты данных и подписываем Соглашение о неразглашении (NDA) с каждым клиентом, чтобы гарантировать безопасность и конфиденциальность всей передаваемой информации.'
} ]
</script>

<style scoped>
.faq {
    padding: 60px 0;

    .container {
        display: flex;
        flex-direction: column;
        justify-content: center;
        align-items: center;
    }

    h2 {
        font-size: 2rem;
        margin-bottom: 1.5rem;
        text-align: center;
    }

    p {
        margin-bottom: 1rem;
        text-align: center;
        width: 85%;
    }
}
</style>