<template>
    <div id="history" class="history">
        <div class="container">
            <h2>История компании</h2>
            <p data-aos="fade-up">ООО «Horizont Consult» — ведущая консалтинговая фирма, основанная в 2023 году командой опытных
                профессионалов с большим опытом работы в финансовом и экологическом секторе. С момента основания наша
                миссия – предоставление высококачественных консалтинговых услуг в области финансов, инвестиционного
                анализа и стратегического планирования.</p>
            <p data-aos="fade-up">С момента своего основания мы стремимся поддерживать прозрачность, надежность и профессионализм в наших
                отношениях с клиентами. Наша услуги охватывает различные финансовые дисциплины, включая инвестиционный
                консалтинг, финансовое планирование и разработку бизнес-планов. Мы помогаем клиентам оптимизировать
                финансовые операции, обеспечивать соответствие нормативным требованиям и повышать прибыльность за счет
                принятия решений на основе данных.</p>
            <p data-aos="fade-up">За два года мы превратились из небольшой группы преданных своему делу специалистов в сфере финансового и
                экологического консалтинга. Благодаря успешной реализации многочисленных ГЧП и инвестиционных проектов в
                различных секторах, включая строительство, спорта, в области экологии, мы заслужили доверие ведущих
                корпораций и государственных структур.</p>
            <p data-aos="fade-up">Основная сила нашей фирмы заключается в нашей способности разрабатывать индивидуальные решения, которые
                решают сложные финансовые проблемы. Независимо от того, помогаем ли мы компаниям с финансовой
                реструктуризацией, стратегиями расширения бизнеса или технико-экономическими обоснованиями для
                крупномасштабных проектов, мы предоставляем действенные идеи, которые способствуют устойчивому росту.
            </p>
            <p data-aos="fade-up">Кроме того, мы уделяем большое внимание инновациям и цифровой трансформации в финансах. Используя
                передовые методы финансового моделирования, аналитику данных и инструменты автоматизации, мы помогаем
                компаниям оптимизировать операции и адаптироваться к меняющимся рыночным условиям.</p>
            <p data-aos="fade-up">С растущим портфелем из более чем 15 успешно завершенных проектов, Horizont Consult продолжает
                устанавливать отраслевые стандарты совершенства. Наши долгосрочные отношения с клиентами отражают нашу
                приверженность достижению ощутимых результатов и содействию успеху бизнеса.</p>
            <p data-aos="fade-up">Расширяя свою деятельность как на местном уровне, мы по-прежнему стремимся оказывать поддержку
                организациям в достижении их финансовых и стратегических целей.</p>
            <p data-aos="fade-up">С момента своего основания наша фирма претерпела значительный рост и трансформацию, отмеченную ключевыми
                вехами, которые отражают нашу приверженность совершенству и расширению.</p>
            <b data-aos="fade-up">2023 – Создание и расширение услуг:</b>
            <p data-aos="fade-up">Horizont Consult была основана в 2023 году командой опытных профессионалов в финансовом секторе, области
                экологии. Изначально компания сосредоточилась на предоставлении услуг аутсорсинга бухгалтерского учета и
                финансового консалтинга, что позволило компаниям повысить финансовую эффективность и соответствие
                требованиям. Осознавая растущий спрос на специализированный финансовый консалтинг, мы расширили наши
                услуги, включив в них инвестиционный консалтинг, помогая клиентам принимать обоснованные инвестиционные
                решения. Кроме того, мы создали специальный отдел по разработке бизнес-планов и технико-экономическим
                обоснованиям, гарантируя, что предприятия смогут обеспечить стратегическое направление и финансовую
                жизнеспособность своих проектов.</p>
            <p data-aos="fade-up">Понимая важность устойчивости и соблюдения нормативных требований, мы запустили услуги экологического
                консалтинга, включая оценку воздействия на окружающую среду, чтобы помочь предприятиям соответствовать
                экологическим и правовым стандартам. Кроме того, мы создали специализированное подразделение по
                разработке проектов государственно-частного партнерства (ГЧП), содействуя сотрудничеству между
                государственными органами и частными предприятиями для стимулирования развития инфраструктуры и
                экономики.</p>
            <b data-aos="fade-up">2025 – Выход на международный рынок:</b>
            <p data-aos="fade-up">К 2025 году Horizont Consult зарекомендовала себя как признанный лидер в области финансового консалтинга
                на внутреннем рынке. Опираясь на этот успех, мы начали экспансию на международный рынок, расширяя наши
                предложения услуг для глобальной клиентуры. Этот стратегический шаг направлен на использование нашего
                опыта в области финансов, бухгалтерского учета, экологии и санитарии для поддержки предприятий и
                государственных структур по всему миру. Наше международное расширение включает в себя формирование
                партнерских отношений с ключевыми заинтересованными сторонами, выход на новые рынки с высоким
                потенциалом роста и адаптацию наших консалтинговых методологий для соответствия различным финансовым,
                экономическим и экологическим условиям.</p>

        </div>
    </div>
</template>

<script setup lang="ts">

</script>


<style scoped lang="scss">
@use "~/assets/scss/mixins" as *;

.history {
    padding: 60px 0;

    .container {
        display: flex;
        flex-direction: column;
        justify-content: center;
        align-items: center;
    }

    h2 {
        font-size: 2rem;
        margin-bottom: 1.5rem;
        text-align: center;
    }

    p {
        margin-bottom: 1rem;
        // text-align: center;
        font-size: 1.1rem;
        text-indent: 2rem; 

        // @include breakpoint(lg) {
        //     width: 90%;
        // }
    }
    b{
        font-size: 1.2rem;
        margin-bottom: 1rem;
        text-align: center;
    }
}
</style>