<template>
    <div id="services" class="service">
        <div class="container">
            <h2>Услуги</h2>
            <div class="service-box" data-aos="fade-up">
                <h3>Разработка бизнес-планов и ТЭО</h3>
                <p>Мы предоставляем профессиональную разработку бизнес-планов и технико-экономических обоснований для
                    инвестиционных проектов любого масштаба. Эти услуги позволяют компаниям оценить осуществимость
                    проекта, прибыльность и долгосрочную устойчивость.
                </p>
                <div>
                    <button class="btn" @click="isOpen1 = !isOpen1"> {{ isOpen1 ? 'Скрыть' : 'Подробнее' }}</button>
                    <transition name="collapse">
                        <div v-if="isOpen1" class=" overflow-hidden">
                            <div class="p-4">
                                <b>Наши предложения:</b>
                                <li>Разработка детальной финансовой модели на основе индивидуального подхода для разных
                                    проектов;</li>
                                <li>Сопровождение процесса прохождения экспертизы в государственных ведомостях до
                                    получение положительных заключений.</li>
                                <p>Наша команда имеет большой опыт разработки бизнес-планов для проектов от малых
                                    предприятий до крупных промышленных комплексов.</p>
                            </div>
                        </div>
                    </transition>
                </div>

            </div>
            <div id="services1" class="service-box" data-aos="fade-up">
                <h3>Отчеты о воздействии на окружающую среду (ЗВОС)</h3>
                <p>Мы проводим комплексную оценку воздействия проектов на окружающую среду и разрабатываем необходимую
                    экологическую документацию в соответствии с требованиями законодательства. Эти отчеты необходимы для
                    получения разрешительной документации и обеспечения соблюдения экологических норм.
                </p>
                <div>
                    <button class="btn" @click="isOpen2 = !isOpen2"> {{ isOpen2 ? 'Скрыть' : 'Подробнее' }}</button>
                    <transition name="collapse">
                        <div v-if="isOpen2" class=" overflow-hidden">
                            <div class="p-4">
                                <b>Наши услуги включают:</b>
                                <li>Проведение экологического аудита;</li>
                                <li>Подготовка отчетов по оценке воздействия на окружающую среду (ЗВОС);</li>
                                <li>Разработка экологических паспортов предприятий;</li>
                                <li>Расчет выбросов загрязняющих веществ и их воздействия;</li>
                                <li>Установление нормативов образования отходов и лимитов на их размещение;</li>
                                <li>Помощь в получении разрешений от контролирующих органов.</li>
                                <p>Наши специалисты по экологии используют передовые методики оценки и
                                    специализированное программное обеспечение для обеспечения точности расчетов и
                                    полного соответствия нормативным требованиям.</p>
                            </div>
                        </div>
                    </transition>
                </div>
            </div>
            <div id="services2" class="service-box" data-aos="fade-up">
                <h3>Инвестиционный консалтинг</h3>
                <p>Мы предлагаем комплексную поддержку инвестиционных проектов, сопровождая их от первоначальной
                    концепции до успешной реализации. Наша экспертиза охватывает все этапы жизненного цикла инвестиций,
                    от стратегического планирования и анализа рисков до обеспечения финансирования и выхода на
                    международные рынки. Наши консалтинговые услуги помогают снизить риски и повысить инвестиционный
                    потенциал.</p>
                <div>
                    <button class="btn" @click="isOpen3 = !isOpen3"> {{ isOpen3 ? 'Скрыть' : 'Подробнее' }}</button>
                    <transition name="collapse">
                        <div v-if="isOpen3" class=" overflow-hidden">
                            <div class="p-4">
                                <b>Наши предложения:</b>
                                <li>Оценка инвестиционной привлекательности и целесообразности;</li>
                                <li>Стратегическое консультирование по обеспечению внутренних и международных
                                    инвестиций.</li>
                                <b>Основные достижения:</b>
                                <li>Успешно завершенные проекты: Более 15;</li>
                                <li>Общий объем привлеченных инвестиций: более 100 млн долларов США.</li>
                            </div>
                        </div>
                    </transition>
                </div>
            </div>
            <div id="services3" class="service-box" data-aos="fade-up">
                <h3>Разработка ГЧП проектов</h3>
                <p>Мы оказываем поддержку полного цикла для проектов государственно-частного партнерства (ГЧП),
                    обеспечивая бесперебойное сотрудничество между государственными структурами и заинтересованными
                    сторонами частного сектора. Наш опыт способствует эффективному структурированию проектов, соблюдению
                    нормативных требований и финансовой устойчивости.
                </p>
                <div>
                    <button class="btn" @click="isOpen4 = !isOpen4"> {{ isOpen4 ? 'Скрыть' : 'Подробнее' }}</button>
                    <transition name="collapse">
                        <div v-if="isOpen4" class=" overflow-hidden">
                            <div class="p-4">
                                <b>Наши услуги включают:</b>
                                <li>Разработка концепции и структурирование проектов ГЧП;</li>
                                <li>Подготовка тендерной документации;</li>
                                <li>Финансовое моделирование и оценка эффективности проекта;</li>
                                <li>Сопровождение при получении согласований в государственных органах;</li>
                                <li>Консультирование на этапе реализации проекта.</li>
                                <b>Мы специализируемся на проектах ГЧП в сферах:</b>
                                <li>Транспортная инфраструктура;</li>
                                <li>Спорт;</li>
                                <li>Городская инфраструктура;</li>
                                <li>Туризм и рекреация.</li>
                                <p>Наши эксперты обладают глубоким пониманием законодательства в сфере ГЧП и концессий,
                                    а также практическим опытом взаимодействия с государственными структурами.</p>
                            </div>
                        </div>
                    </transition>
                </div>
            </div>
            <div class="service-box" data-aos="fade-up">
                <h3>Бухгалтерский аутсорсинг</h3>
                <p>Мы предлагаем полный набор услуг по бухгалтерскому учету, адаптированных для предприятий всех
                    размеров и отраслей. Наш опыт обеспечивает точное ведение финансовой отчетности, соблюдение
                    нормативных требований и оптимизацию затрат, позволяя клиентам сосредоточиться на основных видах
                    деятельности, пока мы занимаемся бухгалтерскими сложностями.
                </p>
                <div>
                    <button class="btn" @click="isOpen5 = !isOpen5"> {{ isOpen5 ? 'Скрыть' : 'Подробнее' }}</button>
                    <transition name="collapse">
                        <div v-if="isOpen5" class=" overflow-hidden">
                            <div class="p-4">
                                <b>Наши услуги включают:</b>
                                <li>Комплексное ведение бухгалтерского и налогового учета;</li>
                                <li>Восстановление учета;</li>
                                <li>Составление и сдача отчетности в налоговые органы;</li>
                                <li>Расчет заработной платы и ведение кадрового учета;</li>
                                <li>Налоговое планирование и финансовая оптимизация;</li>
                                <li>Сопровождение при налоговых проверках и проверках контролирующих органов;</li>
                                <li>Консультационные услуги по вопросам бухгалтерского учета и налогообложения.</li>
                                <b>Преимущества бухгалтерского аутсорсинга:</b>
                                <li>Финансовое покрытие ответственности за ошибки и штрафы;</li>
                                <li>Строгие меры конфиденциальности и безопасности данных;</li>
                                <li>Доступ к передовому бухгалтерскому программному обеспечению без дополнительных
                                    затрат;</li>
                                <li>Команда экспертов, обеспечивающая соблюдение требований и эффективность, а не
                                    зависимость от одного специалиста.</li>
                            </div>
                        </div>
                    </transition>
                </div>
            </div>
        </div>
    </div>
</template>

<script setup lang="ts">
const isOpen1 = ref(false)
const isOpen2 = ref(false)
const isOpen3 = ref(false)
const isOpen4 = ref(false)
const isOpen5 = ref(false)
</script>

<style scoped lang="scss">
.collapse-enter-active,
.collapse-leave-active {
    transition: max-height 0.5s ease;
}

.collapse-enter-from,
.collapse-leave-to {
    max-height: 0;
}

.collapse-enter-to,
.collapse-leave-from {
    max-height: 400px;
}

.service {
    padding: 60px 0;

    h2 {
        font-size: 2rem;
        margin-bottom: 1.5rem;
        text-align: center;
    }

    .service-box {
        border: 1px solid #e3e3e3;
        padding: 20px;
        margin-bottom: 20px;
        border-radius: 5px;
        background: #fff;

        h3 {
            font-size: 1.75rem;
        }

        p {
            margin-top: 0;
            margin-bottom: 1rem;
        }

        .btn {
            color: var(--primary-light-hover);
            border-radius: 6px;
            padding: .4rem .8rem;
            border: 1px solid var(--primary-light-hover);
            transition: all 0.2s ease-in-out;

            &:hover {
                background: var(--primary-light-hover);
                color: #fff;
            }
        }
    }
}
</style>